
Archived entries from file /home/yantar92/Git/emacs-config/config.org
***** FAILED invisible text property seems to interfere with links visibility - some parts are shown when they should not
CLOSED: [2020-05-09 Sat 22:20]
:PROPERTIES:
:CREATED: [2020-04-27 Mon 16:20]
:SUMMARY:  Can't reproduce
:ARCHIVE_TIME: 2020-05-13 Wed 00:45
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Speed up huge org files
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: FAILED
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "FAILED"     from "TODO"          [2020-05-09 Sat 22:20] \\
  Can't reproduce
- Refiled on [2020-04-27 Mon 21:40]
CLOCK: [2020-04-27 Mon 16:20]--[2020-04-27 Mon 16:21] =>  0:01
:END:
***** CANCELLED cursor-sensor-mode actually works even if inhibit-point-motion-hooks is set to non-nil, though there is a chance things will break later... :CANCELLED:
CLOSED: [2020-05-09 Sat 23:20]
:PROPERTIES:
:CREATED: [2020-05-09 Sat 13:25]
:ARCHIVE_TIME: 2020-05-13 Wed 00:45
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Speed up huge org files
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: CANCELLED
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "CANCELLED"  from "TODO"          [2020-05-09 Sat 23:20]
- Refiled on [2020-05-09 Sat 22:13]
CLOCK: [2020-05-09 Sat 13:25]--[2020-05-09 Sat 13:27] =>  0:02
:END:
***** DONE org actually uses outline-isearch-open-invisible-function taking into account org-show-context-detail variable
CLOSED: [2020-05-09 Sat 22:41]
:PROPERTIES:
:CREATED: [2020-05-09 Sat 13:30]
:ARCHIVE_TIME: 2020-05-13 Wed 00:45
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Speed up huge org files
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "TODO"          [2020-05-09 Sat 22:41]
- Refiled on [2020-05-09 Sat 22:13]
CLOCK: [2020-05-09 Sat 13:30]--[2020-05-09 Sat 13:31] =>  0:01
:END:

I am confused how it works.
There is outline-flag-region setting 'isearch-open-invisible property to outline-isearch-open-invisible-function, which is customised by org.

On the other hand, there is org-flag-region setting 'isearch-open-invisible to #'delete-overlay. ???
***** FAILED there is isearch-open-invisible-temporary. does it make sense to set it to something for property overlays only? by default, org just leaves everything shown
CLOSED: [2020-05-09 Sat 22:40]
:PROPERTIES:
:CREATED: [2020-05-09 Sat 17:26]
:SUMMARY:  Org does not leave everything shown
:ARCHIVE_TIME: 2020-05-13 Wed 00:45
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Speed up huge org files
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: FAILED
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "FAILED"     from "TODO"          [2020-05-09 Sat 22:40] \\
  Org does not leave everything shown
- Refiled on [2020-05-09 Sat 22:13]
CLOCK: [2020-05-09 Sat 17:26]--[2020-05-09 Sat 17:27] =>  0:01
:END:
***** TODO can try to get rid of 'outline overlays by changing some outline-* function calls (calling outline-flag-region) in org
:PROPERTIES:
:CREATED: [2020-05-10 Sun 23:59]
:ARCHIVE_TIME: 2020-05-13 Wed 00:45
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Speed up huge org files
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: TODO
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- Refiled on [2020-05-11 Mon 10:23]
CLOCK: [2020-05-11 Mon 02:45]--[2020-05-11 Mon 02:46] =>  0:01
:END:
***** DONE [#A] reply about ways to handle insert into hidden text #email -> $:from Re: [patch suggestion] Mitigating the poor Emacs performance on huge org files: Do not use overlays for PROPERTY and LOGBOOK drawers :EMAIL:
CLOSED: [2020-05-17 Sun 23:02] SCHEDULED: <2020-05-11 Mon>
:PROPERTIES:
:CREATED: [2020-05-11 Mon 10:21]
:EMAIL-SOURCE: [[notmuch:id:87pnbby49m.fsf@nicolasgoaziou.fr]]
:SHOWFROMDATE: 2020-05-16
:ARCHIVE_TIME: 2020-05-19 Tue 01:12
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Speed up huge org files
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"          [2020-05-17 Sun 23:02]
CLOCK: [2020-05-17 Sun 22:47]--[2020-05-17 Sun 23:02] =>  0:15
CLOCK: [2020-05-17 Sun 20:33]--[2020-05-17 Sun 22:47] =>  2:14
CLOCK: [2020-05-17 Sun 20:18]--[2020-05-17 Sun 20:33] =>  0:15
CLOCK: [2020-05-17 Sun 19:47]--[2020-05-17 Sun 20:18] =>  0:31
CLOCK: [2020-05-16 Sat 23:06]--[2020-05-17 Sun 02:17] =>  3:11
- Refiled on [2020-05-11 Mon 10:22]
:END:
***** DONE actually, we can simply reveal the hidden text before/after the changed text (unless the inserted text is hidden)
CLOSED: [2020-06-13 Sat 16:09]
:PROPERTIES:
:CREATED: [2020-05-10 Sun 23:59]
:ARCHIVE_TIME: 2020-06-14 Sun 19:30
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Speed up huge org files
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "TODO"          [2020-06-13 Sat 16:09]
- Refiled on [2020-05-11 Mon 10:24]
CLOCK: [2020-05-11 Mon 02:43]--[2020-05-11 Mon 02:45] =>  0:02
:END:
***** DONE after finishing =isearch= the drawers are not closed back. (actually, they are closed, but reopened again by hi-lock) no idea why
CLOSED: [2020-06-13 Sat 16:09]
:PROPERTIES:
:CREATED: [2020-05-09 Sat 22:11]
:ARCHIVE_TIME: 2020-06-14 Sun 19:30
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Speed up huge org files
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "TODO"          [2020-06-13 Sat 16:09]
- Refiled on [2020-05-09 Sat 22:13]
CLOCK: [2020-05-09 Sat 22:11]--[2020-05-09 Sat 22:12] =>  0:01
:END:
***** FAILED check this for my capture [[file:~/.emacs.d/straight/repos/org/lisp/ol-bibtex.el::;;]]
CLOSED: [2020-07-27 Mon 09:51] SCHEDULED: <2020-07-27 Mon>
:PROPERTIES:
:CREATED: [2020-07-25 Sat 14:15]
:SHOWFROMDATE: 2020-07-27
:SUMMARY:  Too much interactivity
:ARCHIVE_TIME: 2020-08-01 Sat 16:07
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Workflow/Capture/Capturing references (websites, journal papers, files, etc)
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: FAILED
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "FAILED"     from "DONE"          [2020-07-27 Mon 09:51] \\
  Too much interactivity
- State "DONE"       from "NEXT"          [2020-07-27 Mon 09:51]
CLOCK: [2020-07-27 Mon 09:39]--[2020-07-27 Mon 09:51] =>  0:12
- Refiled on [2020-07-25 Sat 15:23]
CLOCK: [2020-07-25 Sat 14:15]--[2020-07-25 Sat 14:59] =>  0:44
:END:
***** DONE key generation on very long titles gives the same keys (part 1,2,3...)
CLOSED: [2020-07-30 Thu 13:46] SCHEDULED: <2020-07-27 Mon>
:PROPERTIES:
:CREATED: [2020-07-27 Mon 08:39]
:SHOWFROMDATE: 2020-07-30
:ARCHIVE_TIME: 2020-08-01 Sat 16:07
:ARCHIVE_FILE: ~/Git/emacs-config/config.org
:ARCHIVE_OLPATH: Emacs configuration/Org mode/Workflow/Capture/Capturing references (websites, journal papers, files, etc)
:ARCHIVE_CATEGORY: config
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: EMACS COMMON
:END:
:LOGBOOK:
- State "DONE"       from "TODO"          [2020-07-30 Thu 13:46]
- Refiled on [2020-07-27 Mon 08:55]
CLOCK: [2020-07-27 Mon 08:39]--[2020-07-27 Mon 08:40] =>  0:01
:END:
